<html>
<body vlink="greenyellow" link="greenyellow" lang="FR" bgcolor="black" text="wheat">


<p><br />Yannick CARLINET <br>
  Research Engineer at Orange, Innovation Division </p>
<hr />
<ul>
<li>Research topics
<ul>
<li>Network Performance Modeling</span></li>
<li>Network Virtualization</span></li>
<li>Traffic Engineering<br /></span></li>
<li>Edge Computing</li>
</ul>
</li>
</ul>
<p>&nbsp;</p>
<ul>
<li>How to reach me
<ul>
<li>E-mail : first_name . family_name @ orange . com (without the spaces)</li>
<li><a href="https://www.linkedin.com/in/yannickcarlinet/">LinkedIn profile</a></li>
<li><a href="https://twitter.com/CarlinetYannick">Twitter profile</a></li>
</ul>
</li>
</ul>
<p>&nbsp;</p>
<hr />
<ul>
<li>Publications</li>
</ul>
<p>&nbsp;</p>
<ol>
<li>Y. Carlinet, E. Gourdin, N. Perrot, &ldquo;The Offline Virtual Network Function Packing Problem&rdquo;, 2021 24th Conference on Innovation in Clouds, Internet and Networks and Workshops (ICIN)</li>
</ol>
<p>&nbsp;</p>
<ol start="2">
<li>Carlinet, N. Perrot, A. Alves-Tzitas, &ldquo;Minimum-Cost Virtual Network Function Resilience&rdquo;, INOC, June 2019</li>
</ol>
<p>&nbsp;</p>
<ol start="3">
<li>Perrot, A. Benhamiche, Y. Carlinet, E. Gourdin, &ldquo;Future Networks: Overview of Optimization Problems in Decision-Making Procedures&rdquo;, In book: Emerging Automation Techniques for the Future Internet, Oct 2018.</li>
</ol>
<p>&nbsp;</p>
<ol start="4">
<li>Carlinet, N. Perrot, &ldquo;Toward Green SDN Networks&rdquo;, In book: Greening Video Distribution Networks, January 2018</li>
</ol>
<p>&nbsp;</p>
<ol start="5">
<li>Carlinet, N. Perrot, "Energy-efficient load balancing in a sdn-based data-center network", <em>2016 17th International Telecommunications Network Strategy and Planning Symposium (Networks)</em><em>,</em> pp. 138-143, Sept 2016.</li>
</ol>
<p>&nbsp;</p>
<ol start="6">
<li>Felipe Olmos, Bruno Kauffmann, Alain Simonian and Yannick Carlinet , &ldquo;CatalogDynamics: Impact of Content Publishing and Perishing on the Performance of a LRU Cache&rdquo;, 2014 26th International Teletraffic Congress (ITC). (<strong>Best papers award</strong>)</li>
</ol>
<p>&nbsp;</p>
<ol start="7">
<li>&ldquo;Contenu g&eacute;n&eacute;r&eacute; par les utilisateurs : une &eacute;tude sur DailyMotion&nbsp;&raquo;, Carlinet, T. D. Huynhy, B. Kauffmann, F. Mathieu, L. Noirie, S. Tixeuil. Algotel 2013.</li>
</ol>
<p>&nbsp;</p>
<ol start="8">
<li>&ldquo;Four Months in DailyMotion: Dissecting User Video Requests&rdquo;, Y. Carlinet, T. D. Huynhy, B. Kauffmann, F. Mathieu, L. Noirie, S. Tixeuil. TRAC 2012.</li>
</ol>
<p>&nbsp;</p>
<ol start="9">
<li>"Evaluation of P4P based on Real Traffic Measurement", Y. Carlinet, L. M&eacute;, Y. Gourhant, H. Debar. ICIMP (International Conference on Internet Monitoring and Protection) 2010.</li>
</ol>
<p>&nbsp;</p>
<ol start="10">
<li>"Caching P2P Traffic: What are the Benefits for an ISP?" Y. Carlinet, L. M&eacute;, Y. Gourhant, H. Debar. ICN (International Conference on Networks) 2010.</li>
</ol>
<p>&nbsp;</p>
<ol start="11">
<li>"D&eacute;tection de vers P2P passifs", N. Khiat, Y. Carlinet, N. Agoulmine, SAR'08 (S&eacute;curit&eacute; des Architectures R&eacute;seaux et des Syst&egrave;mes d'Information), Loctudy, Octobre 2008.</li>
</ol>
<p>&nbsp;</p>
<ol start="12">
<li>"Analysis of computer infection risk factors based on customer network usage", Yannick Carlinet, Ludovic M&eacute;, Herv&eacute; Debar, Yvon Gourhant. Securware'08, Cap Esterel ao&ucirc;t 2008. (<strong>Best papers award</strong>)</li>
</ol>
<p>&nbsp;</p>
<ol start="13">
<li>"The emerging threat of peer-to-peer worms", Nassima Khiat, Yannick Carlinet, Nazim Agoulmine, MonAM'06 (Monitoring, Attack Detection and Mitigation), Tubingen, September 2006</li>
</ol>
<p>&nbsp;</p>
<ol start="14">
<li>M&uuml;nz et al., " DIADEM Firewall: Web Server Overload Attack Detection and Response", Broadband Europe, Paris, September 2005</li>
</ol>
<p>&nbsp;</p>
<ol start="15">
<li>"A Programmable Network Enabling Content Adaptation", Bertrand Mathieu, Yannick Carlinet, Yvon Gourhant, MATA 2004</li>
</ol>
<p>&nbsp;</p>
<ol start="16">
<li>"Retour d'exp&eacute;rience sur diff&eacute;rentes applications de r&eacute;seau actif", Annales des t&eacute;l&eacute;coms 2004</li>
</ol>
<p>&nbsp;</p>
<ol start="17">
<li>"Programmable IP Networks and their Management", Galis, A., Denazis, S., Brou, C., Klein, C. (ed) ; ISBN 1-58053-745-6; pp 430;&nbsp;contracted for publishing in Q1 2004 by Artech House Books, 46 Gillingham Street, London SW1V 1AH, UK; www.artechhouse.com</li>
</ol>
<p>&nbsp;</p>
<ol start="18">
<li>"A Policy-Based Management Architecture for Active and Programmable Networks", Chiho Kitahara and al., IEEE Network journal, May/June 2003</li>
</ol>
<p>&nbsp;</p>
<ol start="19">
<li>"Auto-configuration des n&oelig;uds dans un r&eacute;seau ad hoc : une nouvelle approche bas&eacute;e sur les r&eacute;seaux actifs", Djamal-Eddine MEDDOUR, Yvon GOURHANT, Yannick CARLINET, GRES'03.</li>
</ol>
<p>&nbsp;</p>
<ol start="20">
<li>"Requirements and Enabling Architecture for Ad-Hoc Networks Application Scenarios", Djamal-Eddine MEDDOUR, Bertrand MATHIEU, Yannick CARLINET, Yvon GOURHANT, MadNet'03.</li>
</ol>
<p>&nbsp;</p>
<ol start="21">
<li>MedHoc'02</li>
</ol>
<p>&nbsp;</p>
<ol start="22">
<li>"Modeling CPU Demand in Heterogeneous Active Networks", Virginie Galtier, Kevin L. Mills, Yannick Carlinet, DANCE 2002 (DARPA Active Networks Conference and Exposition).</li>
</ol>
<p>&nbsp;</p>
<ol start="23">
<li>"Predicting resource demand in heterogeneous active networks", V. Galtier, K. Mills, and Y. Carlinet, S. Bush and A. Kulkarni, MilCOM 2001</li>
</ol>
<p>&nbsp;</p>
<ol start="24">
<li>"Predicting and Controlling Resource Usage in a Heterogeneous Active Network", Virginie Galtier, Kevin L. Mills, Yannick Carlinet, Stephen F. Bush, Amit Kulkarni, WAMS 2001 (Workshop on Active Middleware Services - IEEE)</li>
</ol>
<p>&nbsp;</p>
<ol start="25">
<li>"Expressing Meaningful Processing Requirements among Heterogeneous Nodes in an Active Network", Virginie Galtier, Kevin L. Mills, Yannick Carlinet, Stefan Leigh, Andrew Rukhin, WOSP 2000 (Workshop on Software Performance - ACM)</li>
</ol>
<p>&nbsp;</p>
<ol>
<li>"Calibrating an Active Network Node", Yannick Carlinet, Virginie Galtier, Kevin L. Mills, Stefan Leigh, Andrew Rukhin, WAMS 2000 (Workshop on Active Middleware Services - IEEE)</li>
</ol>
<p>&nbsp;</p>
<hr />
<ul>
<li>Patents</li>
</ul>
<p>&nbsp;</p>
<p>1. D&eacute;tection de vers passifs dans un r&eacute;seau pair-&agrave;-pair - n&deg;0851961 - mars 2008</p>
<p>&nbsp;</p>
<p>2. Proc&eacute;d&eacute; et syst&egrave;me de transmission de donn&eacute;es entre un r&eacute;seau local et un r&eacute;seau principal autorisant une adaptation du format desdites donn&eacute;es &ndash; N&deg;0410582 &ndash; 2004</p>
<p>&nbsp;</p>
<p>3. Proc&eacute;d&eacute; de r&eacute;action &agrave; une attaque de d&eacute;ni de service distribu&eacute;e - N&deg;0407642 &ndash; ao&ucirc;t 2004 (&eacute;tendu &agrave; l'international et aux USA en septembre 2006)</p>
<p>&nbsp;</p>
<p>4. Proc&eacute;d&eacute; de r&eacute;action &agrave; une attaque de d&eacute;ni de service distribu&eacute;e exploitant le DNS - N&deg;0407705 &ndash; ao&ucirc;t 2004</p>
<p>&nbsp;</p>
<p>5. Proc&eacute;d&eacute; am&eacute;lior&eacute; d'&eacute;change, entre un serveur et un terminal, de donn&eacute;es relatives &agrave; un environnement virtuel d&eacute;fini par ledit serveur &ndash; N&deg;0403053 &ndash; mars 2004 (&eacute;tendu en Europe et USA &ndash; 25 janvier 2007)</p>
<p>&nbsp;</p>
<p>6. Plate-forme de m&eacute;diation pour r&eacute;seau de transport de messages, 2002</p>
<p>&nbsp;</p>
<p>7. Syst&egrave;me d'acc&egrave;s &agrave; des donn&eacute;es disponibles sur r&eacute;seau actif &agrave; partir d'un terminal communiquant en mode non connect&eacute; et proc&eacute;d&eacute; de mise en &oelig;uvre, 2001</p>
<p>&nbsp;</p>
<hr />
<p>&nbsp;</p>
<p><a href="perso.html">Personal homepage</a> (in French)</p>
<p>Last updated : March 2021</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>

</body>
</html> 


